[
    {
        "dua":"رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا",
        "desc":"For Faith",
        "eng":"Our Lord! We have heard someone calling us to faith- “ Believe in your Lord”- and we have believed."
    },
    
    {
        "dua":"اللَّهُمَّ عَافِنِي فِي بَدَنِي اللَّهُمَّ عَافِنِي فِي سَمْعِي اللَّهُمَّ عَافِنِي فِي بَصَرِي لاَ إِلَهَ إِلاَّ أَنْتَ",
        "desc":"For Good Health",
        "eng":"O Allah! Grant me health in my body. O Allah! Grant me good hearing. O Allah! Grant me good eyesight. There is no god but Thou."
    },

    {
        "dua":"رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ",
        "desc":"For Decision",
        "eng":"Our Lord, decide between us and our people in truth, for You are the Best of Deciders."
    },

    
    {
        "dua":"رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا",
        "desc":"For Forgiveness & Brotherhood",
        "eng":"Our Lord, forgive us and our brothers and sisters who preceded us in faith and put not in our hearts [any] resentment toward those who have believed."
    },

    {
        "dua":"رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ",
        "desc":"For Relief",
        "eng":"Lord, do not burden us as You burdened those before us."
    },

    {
        "dua":"رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ ",
        "desc":"For Justice ",
        "eng":"Our Lord! Judge between us and our people with truth. You are the best of those who judge."
    },

    {
        "dua":"نـَوَيْتُ صَوْمَ غـَدٍ عَـنْ ا َدَاءِ فـَرْضِ شـَهْرِ رَمـَضَانَ هـَذِهِ السَّـنـَةِ لِلـّهِ تـَعَالى",
        "desc":"At the Beginning of the Fast",
        "eng":"I intend to do obligatory fast tomorrow in the month of Ramadan this year because of Allah"
    },

    {
        "dua":"وَبِصَوْمِ غَدٍ نَوَيْتُ مِنْ شَهْرِ رَمَضَانَ",
        "desc":"At the Beginning of the Fast",
        "eng":"I intend to keep the fast for tomorrow in the month of Ramadan"
    },

    {
        "dua":"رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "desc":"For Light",
        "eng":"Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent."
    },

    {
        "dua":"رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ",
        "desc":"For Reliance on Allah",
        "eng":"Our Lord, upon You we have relied, and to You we have returned, and to You is the destination."
    }
]